root/www/config/supplier/tourico/GetRGInfo_RQ.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://schemas.tourico.com/webservices/hotelv3">
	<SOAP-ENV:Header>
		<m:AuthenticationHeader xmlns:m="http://schemas.tourico.com/webservices/authentication">
			<m:LoginName>XXXX</m:LoginName>
			<m:Password>YYYY</m:Password>
			<m:Culture>en_US</m:Culture>
			<m:Version>5</m:Version>
		</m:AuthenticationHeader>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<m:GetRGInfo xmlns:m="http://tourico.com/webservices/hotelv3">
			<m:request>
				<m0:RGId>289602602</m0:RGId>
			</m:request>
		</m:GetRGInfo>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
